"""
返回函数
"""


# 求和函数，立即返回结果
def cals_sum(*args):
    ax = 0
    for arg in args:
        ax += arg
    return ax


print(cals_sum(1, 2, 3, 4, 5, 6, 7, 8))

"""
但是，如果不需要立刻求和，而是在后面的代码中，根据需要再计算怎么办？可以不返回求和的结果，
而是返回求和的函数：

在这个例子中，我们在函数lazy_sum中又定义了函数sum，并且，内部函数sum可以引用外部函数lazy_sum的参数和局部变量，当lazy_sum返回函数sum时，相关参数和变量都保存在返回的函数中，这种称为“闭包（Closure）”的程序结构拥有极大的威力。

请再注意一点，当我们调用lazy_sum()时，每次调用都会返回一个新的函数，即使传入相同的参数：
"""


def lazy_sum(*args):
    def sum():
        ax = 0
        for arg in args:
            ax += arg
        return ax

    return sum()


sum = lazy_sum(1, 2, 3, 4, 5, 6)
print(sum)

"""
使用闭包，就是内层函数引用了外层函数的局部变量，如果只是读外层变量的值我们会发现调用一切正常
"""


def inc():
    x = 0

    def fn():
        #         仅读取x的值
        return x + 1

    return fn()


f = inc()
print(f)

"""
但是，如果对外层变量赋值，由于Python解释器会把x当做函数fn()的局部变量，他会报错，
如果当成局部变量那么x就未被初始化
"""
def inc():
    x = 0

    def fn():
        # UnboundLocalError: cannot access local variable 'x' where it is not associated with a value
        # x = x + 1
        return x

    return fn()


f = inc()
print(f)

"""
 💡提示

使用闭包时，对外层变量赋值前，需要先使用nonlocal声明该变量不是当前函数的局部变量。
"""
def inc():
    x = 0

    def fn():
        nonlocal  x
        x += 1
        return x

    return fn()


f = inc()
print(f)